<?php
	include("../Connection.php");
	
	session_start();
	
	$filename = $_SERVER["PHP_SELF"];

	if(isset($_POST["submit"]))
	{
		include("insertComment.php");
		unset($_POST["submit"]);
		header("Location:".$filename);
	}
echo"<!DOCTYPE html>
<html>

<head>
  <meta charset='utf-8'>
  <title>Game Reviews</title>
  <link rel='stylesheet' type='text/css' href='../style.css' />
</head>

<body>
  <table id='consoles'>
	<tr>
		<td>PC</td><td>PS4</td><td>XBOX ONE</td><td>Wii U</td><td>PS3</td><td>XBOX 360</td><td>PS VITA</td><td>MAC</td><td>ANDROID</td><td>IOS</td>
	</tr>
  </table>
  <img id='static' src='../gamer.jpg' width='1200px' height='500px'>
  <!--<nav id='nav01'></nav>-->
<div id='toolbar'>";
		if(isset($_SESSION["user"]))
			echo "<a href='../logout.php' id='login'>Logout</a>
					<a href='../profile.php' id='register'>Profile</a>";
		else 
			echo "<a href='../login.php' id='login'>Login</a>
					<a href='../register.php' id='register'>Register</a>";
		echo "<form action='../search.php' method='GET'>
			<input type='text' id='search' name='keyword' placeholder=' Search...' />
			<input type='image' id='searchbutton' name='submit'src='../search.png'/><br /><br />
			</form>
</div>
<nav id='cssmenu'>
	<ul>
		<li><a href='../index.php'>Home</a></li>
		<li><a href='../news.php'>News</a></li>
		<li><a href='../tributes.php'>Αφιερώματα</a></li>
		<li><a href='../reviews.php'>Reviews</a></li>
		<li><a href='../about.php'>About</a></li>
		<li><a href='../contact.php'>Contact</a></li>
	</ul>
</nav>

<div id='main'>
	<h1>H ιστορία των Video Games</h1>
	<p>
		Η σχέση των Ελλήνων με τα video games ξεκίνησε σαν ένα πανάκριβο δώρο της θείας από την Αμερική.
		Συνεχίστηκε σαν αγαπημένο πέρασμα του χρόνου της κοπάνας, για να εξελιχθεί σε οικιακή συσκευή ψυχαγωγίας,
		που σε όλο και περισσότερες περιπτώσεις απευθύνεται σε όλη την οικογένεια.
	</p>
	<img src='pacman.jpg'>
	<p>
		Το όνομα της πρώτης κονσόλας video games στον κόσμο ήταν Magnavox Odyssey. Σχεδιάστηκε από τον Μπάερ
		έναν Γερμανό εφευρέτη που ζούσε στην Αμερική. Στις αρχές της δεκαετίας του ’60 ανακάλυψε το πρώτο video game,
		που θα γίνει γνωστό στην Ελλάδα σαν «Pong». Για να προσεδαφιστεί αυτό το παιχνίδι στην Ελλάδα χρειάστηκε έναν Atari 2600.
		Πρόκειται για την πρώτη μαζικά επιτυχημένη, σε επίπεδο πωλήσεων, κονσόλα ηλεκτρονικών παιχνιδιών στην Ελλάδα. Γιατί η Atari
		«έκλεψε» το «Pong». Και παρότι ο εφευρέτης του αποζημιώθηκε από την Atari -όπως και από την Ιστορία, με το μετάλλιο
		για τις τεχνολογικές του ανακαλύψεις που του απονεμήθηκε από τον Τζορτζ Μπους- η εταιρεία έβγαλε πολύ περισσότερα
		από τις πωλήσεις.
	</p>
	<p>
		«Ο Μπάερ είχε το όραμα να φτιάξει μια διαδραστική τηλεόραση. Μία τηλεόραση που θ’ ανταποκρίνεται στον τηλεθεατή.
		Το έκανε χρησιμοποιώντας τον υπολογιστή που έπαιζαν στο ΜΙΤ. Εφτιαξε το 'Brown Box'. Αλλά η ATARI, που πήρε το παιχνίδι
		του, κερδίζει τον πόλεμο του marketing. Γίνεται αναγνωρίσιμη. Είναι η πρώτη εταιρεία που βγάζει ένα κουτί με το παιχνίδι
		Atari-Pong που βγαίνει στα cafe-bar.»
	</p>
	<p>
		Ο Βασίλης Χαραλαμπίδης καθώς και οι φίλοι του από το bios έχουν κάθε λόγο να μιλούν για video games. Η ιστορία τoυς
		στην Ελλάδα είναι μία απογραφή στις κούτες που έχουν με τις συσκευές των ηλεκτρονικών παιχνιδιών στον πάνω όροφο του bios.
		Πρόκειται όχι μόνο για τη μεγαλύτερη συλλογή στην Ελλάδα αλλά και για την τρίτη μεγαλύτερη συλλογή συσκευών ηλεκτρονικών
		παιχνιδιών στην Ευρώπη.
	</p>
	<p>
		Σύμφωνα μ’ αυτούς λοιπόν, μετά την εμφάνιση των Atari η άλλη μεγάλη επιτυχία-σταθμός για την ιστορία των ηλεκτρονικών
		παιχνιδιών στην Ελλάδα είναι οι υπολογιστές Commodore και Spectrum. Μετά υπήρξαν οι Amstrad 464 και 6128. «Ηταν παιχνιδομηχανές
		με τη μορφή υπολογιστή και πολλοί άνθρωποι το μπέρδευαν. Το ’βλεπαν σαν μεταίχμιο. Μετά βγήκαν τα πρώτα παιχνίδια που ’χαν
		?scrolling?. Το οποίο άρχισε με το Space Invaders.»
	</p>
	<p>
		Το «Space Invaders», πρόγονος των «shooting games», σχεδιάστηκε από τον Τομοχίρο Νισικάντο το 1978 και κυκλοφόρησε από την
		εταιρεία Tatio το 1980. Πρόκειται για μια εποχή που με δορυφόρους, όπως ο «Voyager 1», οι άνθρωποι έστελναν στοιχεία για τον
		πλανήτη μας μέσα στον «χρυσό δίσκο» προκειμένου να τα ανακαλύψουν άλλοι πολιτισμοί πέρα από το δικό μας. Η εμφάνιση του «Space Invaders»
		εκτός από την εκτόξευση του «Voyager 1» συμπίπτει με την κυκλοφορία στην αγορά των «micro computers» Commodore PET και ATARI. 
	</p>
	<p>
	    «Μετά την ATARI και την Amiga εμφανίζονται ξανά οι αμιγείς παιχνιδομηχανές. Δηλαδή έχουμε ξεχωριστά τον computer από την παιχνιδομηχανή.»
		Ετσι εμφανίστηκαν αργότερα προσωπικοί υπολογιστές σαν τον IBM PS/1 και οι κονσόλες παιχνιδιών όπως η Sega και η Nintendo: «Οι κονσόλες
		έγιναν μόδα στην Ελλάδα μετά το ’90. Οι πιο δημοφιλείς ήταν οι Sega και Nintendo? Αργότερα, το ’95, βγήκε το Playstation και σήμανε πλέον
		η εποχή που το να παίζεις παιχνίδια δεν σημαίνει ότι είσαι 12 χρονών», μας είπε ο Γιάννης Αναγνώστου, από την ομάδα του bios. Μέχρι
		το 1997 το Sony Playstation θα πουλήσει 20 εκατομμύρια κονσόλες παγκοσμίως. Στην Ελλάδα ήταν η πιο δημοφιλής κονσόλα ηλεκτρονικών παιχνιδιών.
		Τα κουμπάκια του joystick του θα γίνουν τα τέσσερα σημεία του εικονικού ορίζοντα του παίκτη ηλεκτρονικών παιχνιδιών που έχει φτάσει πλέον και τα 30.
	</p>
	<p><h4>Παιχνίδια του χεριού</h4>
		Η διάδοση της κονσόλας των ηλεκτρονικών παιχνιδιών ταυτίζεται σχεδόν με την εμφάνιση αντιπροσώπων της Nintendo (Nortec) και της Sony Playstation
		(Sony Hellas) στην Ελλάδα: «Η Nintendo αντιπροσωπεύεται στην Ελλάδα τα τελευταία 11 χρόνια.<br />
		<img src='NES.jpg' width='700px' height='300px'><br />
		Τότε ήταν η μεταβατική περίοδος στις οικιακές
		κονσόλες: από το NES πηγαίναμε στο Super NES. Μιλάμε για τις πρώτες κονσόλες που είχαν ευρεία απήχηση» θα μας πει ο brand manager της Nintendo
		στην Ελλάδα Κώστας Καμπάκης: «Το ’97 μιλάγαμε ακόμα για την περίοδο του «Gameboy». Tο γκρίζο μηχανηματάκι γνωστό κι ως «τούβλο» στους λάτρεις του». 
	</p>
	<p>
		Το «Game Boy» κυκλοφόρησε από τη Nintendo το 1989. Και θα είναι το πρώτο «handheld» (στο μέγεθος του ενός χεριού) που γνώρισε τέτοια μαζική κυκλοφορία.
		«Οι συνολικές του πωλήσεις από το ’97 μέχρι το 2000 που κυκλοφορούσε στην Ελλάδα είναι γύρω στις 90.000 κομμάτια. Μετά βγήκαν κι άλλα μοντέλα όπως
		το advanced, το color και το ?micro Game Boy. Συνολικά πούλησε στην Ελλάδα ένα εκατομμύριο τεμάχια. Αλλά μιλάμε για πέντε διαφορετικά μοντέλα μέσα
		σε δέκα χρόνια.»
	</p>
	<p>
		Το 1989 για την ίδια συσκευή σχεδιάστηκε στη Ρωσία το Tetris. Τα δικαιώματά του πουλήθηκαν «για ένα κομμάτι ψωμί». Τα παιχνίδια
		«handheld» έγιναν γνωστά στην Ελλάδα και στον υπόλοιπο κόσμο χάρη στο «Gameboy». Παρ’ όλα αυτά, τα πρώτα «handheld» ξεκίνησαν στα
		μέσα της δεκαετίας του ’80, σύμφωνα με τον Βασίλη Χαραλαμπίδη: «Ηταν το tic-tac-toe και το Simon Says το οποίο ήταν σαν ιπτάμενος
		δίσκος. Aναβαν διαφορετικά χρώματα κι έπαιζε μια μελωδία που εσύ έπρεπε να επαναλάβεις.» 
	</p>
	<p><h4>Η Ελληνική ιδιαιτερότητα</h4>
		Σύμφωνα με τους διευθυντές marketing των σημαντικότερων εταιρειών ηλεκτρονικών παιχνιδιών, η ελληνική αγορά ακολουθεί, όσον αφορά τις πωλήσεις κονσολών
		και παιχνιδιών, τις τάσεις της ευρωπαϊκής. Αυτό συνέβαινε τουλάχιστον μέχρι δύο με τρία χρόνια πριν: «Για τη Nintendo, η μεγαλύτερη αγορά ήταν η Ιαπωνία, ακολουθούσαν
		οι ΗΠΑ, στην τρίτη θέση η αγορά της Ευρώπης, με τις υπόλοιπες περιοχές, όπως η Αφρική, να κρατούν ένα πολύ μικρό μερίδιο? Τα τελευταία δύο χρόνια παρατηρούμε μια άνοδο
		της Ευρώπης με αποτέλεσμα να έχει ίσο μερίδιο στην παγκόσμια αγορά με την Αμερική.» θα μας πει ο brand manager της Nintendo Κώστας Καμπάκης. 
	</p>
	<p>
		Παρότι η Ελλάδα ακολουθεί τις ευρωπαϊκές αγορές υπάρχουν περιπτώσεις παιχνιδιών που πουλάνε στην Ελλάδα περισσότερο: Το «Pokemon» και ο «Bob Σφουγγαράκης» ήταν
		'franchise' που γνώρισαν στην Ελλάδα πολύ μεγαλύτερη επιτυχία από άλλες ευρωπαϊκές χώρες.
	</p>
	<p>
		Eνα άλλο χαρακτηριστικό των Ελλήνων καταναλωτών είναι ότι ενώ παρουσιάζουν σημαντικό βαθμό αφοσίωσης σε μια κονσόλα, «όταν αλλάζουν το κάνουν ραγδαία».
		Κι αυτό φάνηκε από την πορεία των πωλήσεων μιας κονσόλας της οποίας η παγκόσμια κυκλοφορία έγινε το 2006. Στην Ελλάδα οι πωλήσεις της έφτασαν στα 81 χιλιάδες
		τεμάχια -με τη ζήτηση να παραμένει ακόμα ανώτερη από την προσφορά. Μετά την κυκλοφορία του το Πάσχα, οι πωλήσεις ενός παιχνιδιού fitness συμβατού με τη συγκεκριμένη
		κονσόλα είχε φτάσει μέχρι τέλη Αυγούστου τα 21 χιλιάδες τεμάχια, τη στιγμή που στην Ελλάδα ένα παιχνίδι θεωρείται πετυχημένο όταν «πιάσει» τα 6 με 7 χιλιάδες κομμάτια.
		«Και αυτό παρόλο που δεν φημιζόμαστε για λάτρεις του fitness. Προτιμάμε την καλοπέραση από το ν’ ασχολούμαστε με το σώμα μας τουλάχιστο σε σύγκριση με τις χώρες
		της Βόρειας Ευρώπης... Αλλά για το συγκεκριμένο παιχνίδι είδαμε πολύ καλή απήχηση και πιο γρήγορη αποδοχή στην Ελλάδα σε σχέση με τις χώρες της Βόρειας Ευρώπης», θα
		μας πει ο brand manager της Nintendo. 
	</p>
	<p>
		Ο υπεύθυνος account manager για τη Sony Playstation στην Ελλάδα, Χριστόφορος Σαραγάς, θα μας μιλήσει για μία ακόμα τάση που κάνει την εμφάνισή της στην ελληνική αγορά,
		το social gaming. «Yπάρχει η τάση στο εξωτερικό, όπως και στην Ελλάδα, του social gaming όπου παίζουν πολλοί μαζί. Και είναι πιο διασκεδαστικά και πιο ευχάριστα. Ενα
		απ’ αυτά είναι το Sing Star, που αφορά τραγούδια. Ή το Buzz, που είναι σαν Trivial Pursuit». Η επιτυχία αυτών των παιχνιδιών δείχνει ότι τα ηλεκτρονικά παιχνίδια ικανοποιούν
		το όραμα του Μπάερ: απευθύνονται σ’ ολόκληρη την οικογένεια.
	</p>
	<p>
		Για τα είδη των παιχνιδιών που έχουν επιτυχία στην Ελλάδα μας μίλησε ο Κωνσταντίνος Μαχαίρας, υπάλληλος της Dionic, που μαζί με τη CD media, τη Centric και τη Zegetron
		αποτελεί μία από τις μεγαλύτερες εταιρείες διανομής ηλεκτρονικών παιχνιδιών στην Ελλάδα: «1. αθλητικά 2. αγώνες ταχύτητας, 3. δράσης, περιπέτειας (τα «αντβεντσουράκια»)
		4) MMO (Massive Multiplayers Online?), τα παιχνίδια που παίζονται από πολλούς παίκτες μαζί στο δίκτυο.» 
	</p>
	<p><h4>21st Century (Game)Boy</h4>
		Ο 21ος αιώνας συμβολίζει την «περίοδο της ωριμότητας» της βιομηχανίας των ηλεκτρονικών παιχνιδιών. Κέρδισαν μεγαλύτερο σε ηλικία κοινό. Και σε πολλές περιπτώσεις παιχνιδιών,
		το ποσοστό των γυναικών χρηστών έφτασε το 49%. «Το 2007 είδαμε πολύ μεγάλη ανάπτυξη στο σύνολο της βιομηχανίας σε παγκόσμιο επίπεδο. Κι αυτό είναι λογικό αν σκεφτούμε ότι
		είναι μια βιομηχανία που λειτουργεί γύρω στα 20 χρόνια. Εχει φτάσει σε μια ωριμότητα. 
	</p>
	<p>
		Από την άλλη, η τεχνολογία υπάρχει πιο πολύ στη ζωή μας. Αλλά και τα video games έχουν γίνει πιο απλά σε επίπεδο χειρισμού», παρατηρεί ο Κώστας Καμπάκης. Αυτή η καινούργια
		μαζικότητα των ηλεκτρονικών παιχνιδιών οφείλεται επίσης στις πολλαπλές χρήσεις μιας σύγχρονης κονσόλας: «Για παράδειγμα η Playstation 3 (σ.σ. μαζί με τη Wii της Nintendo και την Xbox
		της Microsoft αποτελούν τους τρεις μεγάλους «παίκτες» της αγοράς) έχει διάφορες δυνατότητες επιπλέον του παιχνιδιού όπως είναι η παρακολούθηση blueray ταινιών. Μπορείς να μπαίνεις
		στο διαδίκτυο, να «ανεβάζεις» φωτογραφίες ή να ακούσεις μουσική. Μπορεί να παρέχει μια συνολική διασκέδαση στο σπίτι», θα μας πει ο Χ. Σαραγάς, account manager για τη Sony Playstation. 
	</p>
	<p>
		Και μετά ήρθε ο κινηματογράφος. Η σχέση των ηλεκτρονικών παιχνιδιών με τον κινηματογράφο είναι τόσο παλιά όσο και ο «Ε.Τ.», που έγινε θέμα παιχνιδιού της Atari. «Βγήκαν 15 εκατομμύρια
		παιχνίδια που δεν αγόρασε κανένας. Κι αυτό γιατί το παιχνίδι είχε τόσα πολλά γραφικά που δεν μπορούσες να παίξεις καθόλου. Πίστευαν ότι επειδή είχε επιτυχία η ταινία θα τα αγοράσουν όλοι.
		Αλλά κανείς δεν υπολόγισε πως να πουλήσουμε 15 εκατομμύρια κόπιες ενώ έχουμε πουλήσει 5 εκατομμύρια μηχανήματα. Ετσι πήγαν όλα στη χωματερή» θα μας πει ο Γιάννης Αναγνώστου από το bios.
	</p>
	<p>
		Η συνέχεια της μεταφοράς κινηματογραφικών επιτυχιών σε ηλεκτρονικά παιχνίδια γνώρισε μεγαλύτερη επιτυχία από τον «Ε.T.». Αυτό απέδειξε η επιτυχία του «Robocop» ή του «Νευρομάντη». «Tα video
		games και o κινηματογράφος είναι δύο βιομηχανίες που επικοινωνούν εδώ κι αρκετά χρόνια. Αυτό που συνήθως συνέβαινε ήταν ότι ταινίες του κινηματογράφου γίνονταν video games.
		Πλέον έχουμε σιγά-σιγά και το αντίθετο» θα μας πει ο brand manager της Nintendo. Μία από τις πιο δημοφιλείς περιπτώσεις video games που έγιναν ταινίες ήταν η Lara Croft και
		το «Tomb Raider». Ακολούθησαν κι άλλες όπως το «Max Pain», το «Hitman» ή παλιότερα το «Silent Hill» και το «Resident Evil». Η μεταφορά ηλεκτρονικών παιχνιδιών στη μεγάλη οθόνη
		αποτελεί ακόμα ένα στοιχείο που μας δείχνει ότι η αγορά των ηλεκτρονικών παιχνιδιών απευθύνεται πλέον σε μεγάλη μάζα. «Τα ηλεκτρονικά παιχνίδια έχουν φύγει από τις αρχικές απλές
		μορφές τους κι έχουν πάει σε πολύ πιο πολύπλοκες με αποτέλεσμα να έχουμε πολύπλοκους χαρακτήρες, πολυδιάστατες ιστορίες, κάτι που είναι πρόσφορο έδαφος και για την αγορά του κινηματογράφου», μας εξηγεί ο Κώστας Καμπάκης.
	</p>
	<p>
		Σύμφωνα με άρθρο των New York Times, στον κινηματογράφο 2 από τις 10 ταινίες θα πραγματοποιήσουν κέρδη. Τα ίδια ποσοστά, σύμφωνα με το ίδιο άρθρο, αρχίζει να αποκτά και
		η βιομηχανία ηλεκτρονικών παιχνιδιών. Ενα παιχνίδι που κοστίζει 10 εκ. δολάρια και παίρνει άλλα 10 εκ. για την προώθησή του στην αγορά θα πρέπει να πουλήσει παραπάνω τεμάχια
		απ’ ό,τι ένα αντίστοιχο παιχνίδι στα τέλη της δεκαετίας του ’90 που το μέσο μπάτζετ παραγωγής ενός video game έφτανε τα 3 εκ. δολάρια. Και τα ποσά μπορεί να γίνουν πολύ
		υψηλότερα για μερικά παιχνίδια. Η Atari ξόδεψε 20 εκ. δολάρια για το «Enter the Matrix».Μπορεί τα ηλεκτρονικά παιχνίδια να μην έχουν φτάσει το κόστος μιας χολιγουντιανής
		υπερπαραγωγής, αλλά αν διατηρηθούν οι σημερινοί ρυθμοί αύξησης των εσόδων των μεγάλων παραγωγών video games όπως είναι η Νο.1 στον κόσμο Electronic Arts και η No.2 Activision
		σύντομα θα το ξεπεράσουν. Κάτι που αποδεικνύει ότι η βιομηχανία των ονείρων έχει αποκτήσει σαν καύσιμο την αισθητική των παιχνιδιών που έχουμε στην κονσόλα μας. Το μόνο που μας
		χωρίζει από αυτόν τον κόσμο είναι δύο λέξεις: Πάτα Start. 
	</p>
	<p>
		<a href='http://www.ethnos.gr/article.asp?catid=22733&subid=2&pubid=2036888'>Πηγή</a>
	</p>
	<br /><br />";
	
	$path = "Uploads/".basename($_SERVER["PHP_SELF"]);
	$sql = mysql_query("SELECT fid FROM files WHERE path='$path'") or die(mysql_error());
	$file_row = mysql_fetch_array($sql);
	$fid = $file_row["fid"];
	$name = $_SESSION["user"];
	
	if(isset($_SESSION["user"]))
	{
		echo"
		<form action='$filename' method='POST'>
		<table>
			<tr><td colspan='2'>Σχόλιο: </td></tr>
			<tr><td colspan='2'><input type='hidden' name='name' value='$name'></td></tr>
			<tr><td colspan='5'><textarea name='comment' rows='10' cols='50'></textarea></td></tr>
			<tr><td colspan='2'><input type='hidden' name='fid' value='$fid'></td></tr>
			<tr><td colspan='2'><input type='submit' name='submit' value='Υποβολή'></td></tr>
		</table>
		</form>";
	}
	$sql = mysql_query("SELECT * FROM comments WHERE fid='$fid' ORDER BY created DESC");
	echo"<table>";
	while ($row = mysql_fetch_array($sql))
	{
		echo "<tr><td><h3>".$row["name"]."</h3></td></tr>";
		echo "<tr><td>".$row["comment"]."</td></tr>";
	}
	echo"
	</table>
</div>
</body>
</html>";
?>